# SkylightWidth Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
MassSurfaceData..::..SkylightWidth Property
MassSurfaceData Class See Also
---
The length dimension to be used for the sides of each individual square skylight produced in the grid of auto-generated skylights.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public double SkylightWidth { get; set; }
```

Visual Basic
---
```text
Public Property SkylightWidth As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double SkylightWidth {
	double get ();
	void set (double value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: The skylight width is less than eight inches. |

# See Also
MassSurfaceData Class
Autodesk.Revit.DB.Analysis Namespace